# coding: utf-8
# @FileName: oj_1.py
# @Time: 2022/8/14 14:39
# @Author: QHB

"""
=================================================================
输入描述: 多个测试用例, 每个测试用例一行
        每行通过,隔开, 有n个字符
输入例子:
    a,c,bb
    f,dddd
    nowcoder
==================================================================
输出描述: 对于每组测试用例, 输出一行排序过的字符串, 每个字符串通过','隔开, 无结尾空格
输出例子:
    a,bb,c
    dddd,f
    nowcoder
==================================================================
"""

while True:
    try:
        num = list(input().split(","))
        num.sort()
        print(",".join(num))
    except:
        break
