# coding: utf-8
# @FileName: oj_1.py
# @Time: 2022/8/14 14:39
# @Author: QHB

"""
=================================================================
输入描述: 输入包括两个正整数a、b, 输入数据有多组, 如果输入为0 0, 则结束输入
输入例子:
    1 5
    10 20
    0 0
==================================================================
输出描述: 输出a+b的结果
输出例子:
    6
    30
==================================================================
"""

while True:
    try:
        num = list(map(int, input().split(" ")))
        if num[0] == num[1] == 0:
            break
        print(sum(num))
    except:
        break
