# coding: utf-8
# @FileName: oj_1.py
# @Time: 2022/8/14 14:39
# @Author: QHB

"""
=================================================================
输入描述: 输入数据包括多组. 每组数据一行, 每行的第一个整数为整数的个数n, n为0的时候结束输入.
        接下来n个正整数, 即需要求和的每个正整数.
输入例子:
    4 1 2 3 4
    5 1 2 3 4 5
    0
==================================================================
输出描述: 每组数据输出求和的结果
输出例子:
    10
    15
==================================================================
"""

while True:
    try:
        num = list(map(int, input().split(" ")))
        if num[0] == 0:
            break
        print(sum(num[1:]))
    except:
        break
