# coding: utf-8
# @FileName: oj_1.py
# @Time: 2022/8/14 14:39
# @Author: QHB

"""
=================================================================
输入描述: 输入数据有多组, 每行表示一组输入数据.
        每行不定有n个整数, 空格隔开.
输入例子:
    1 2 3
    4 5
    0 0 0 0 0
==================================================================
输出描述: 每组数据输出求和的结果
输出例子:
    6
    9
    0
==================================================================
"""

while True:
    try:
        num = list(map(int, input().split(" ")))
        print(sum(num))
    except:
        break
